# 5. Реализовать класс Stationery (канцелярская принадлежность).
# ● определить в нём атрибут title (название) и метод draw (отрисовка). Метод выводит
# сообщение «Запуск отрисовки»;
# ● создать три дочерних класса Pen (ручка), Pencil (карандаш), Handle (маркер);
# ● в каждом классе реализовать переопределение метода draw. Для каждого класса
# метод должен выводить уникальное сообщение;
# ● создать экземпляры классов и проверить, что выведет описанный метод для каждого
# экземпляра.

class Stationery:
    def __init__(self, title='пример'):
        self.title = title

    def draw(self):
        print(f'Запуск отрисовки {self.title}')


class Pen(Stationery):
    def draw(self):
        print(f'Рисуем ручкой {self.title}')


class Pencil(Stationery):
    def draw(self):
        print(f'Рисуем карандашем {self.title}')


class Marker(Stationery):
    def draw(self):
        print(f'Рисуем маркером {self.title}')


sample = Stationery()
pen = Pen('Паркер')
pencil = Pencil('Эрих Краузе')
marker = Marker('Нонейм')

stationery_list = [sample, pen, pencil, marker]

for item in stationery_list:
    item.draw()
